# GetCurrentBrowserOrganizationForSchedules Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BrowserOrganization..::..GetCurrentBrowserOrganizationForSchedules Method
BrowserOrganization Class See Also
---
Gets the BrowserOrganization that applies to the Schedules section of the project browser.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static BrowserOrganization GetCurrentBrowserOrganizationForSchedules(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetCurrentBrowserOrganizationForSchedules ( _
	document As Document _
) As BrowserOrganization
```

Visual C++
---
```text
public:
static BrowserOrganization^ GetCurrentBrowserOrganizationForSchedules(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Revit document from which to get the organization data.
# ### Return Value
The BrowserOrganization for schedules, or null if no schedules sections exist
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace